<template>
  <b-modal id="modal2" hide-footer title="개인정보 취급 위탁 동의설명">
    <ul>
      <a>
        개인정보보호법에 따라 BEEZ에 회원가입 신청하시는 분께 수집하는
        개인정보의 항목, 개인정보의 수집 및 이용목적, 개인정보의 보유 및
        이용기간, 동의 거부권 및 동의 거부 시 불이익에 관한 사항을 안내를
        드리오니 자세히 읽은 후 동의하여 주시기 바랍니다.</a
      >
    </ul>

    <p>
      1. 수집하는 개인정보 이용자가 서비스를 이용하기 위해 회원가입을 할 경우,
      BEEZ는 서비스 이용을 위해 필요한 최소한의 개인정보를 수집합니다. 회원가입
      시점에 BEEZ가 이용자로부터 수집하는 개인정보는 아래와 같습니다.
    </p>
    <p>
      - 회원 가입 시에 ‘이메일, 비밀번호, 이름, 휴대전화번호’를 필수항목으로
      수집합니다. 서비스 이용 과정에서 이용자로부터 수집하는 개인정보는 아래와
      같습니다. BEEZ 내의 개별 서비스 이용, 이벤트 응모 및 경품 신청 과정에서
      해당 서비스의 이용자에 한해 추가 개인정보 수집이 발생할 수 있습니다.
      추가로 개인정보를 수집할 경우에는 해당 개인정보 수집 시점에서 이용자에게
      ‘수집하는 개인정보 항목, 개인정보의 수집 및 이용목적, 개인정보의
      보관기간’에 대해 안내 드리고 동의를 받습니다. 서비스 이용 과정에서 IP
      주소, 쿠키, 서비스 이용 기록, 기기정보, 위치정보가 생성되어 수집될 수
      있습니다.
    </p>
    <p>
      1) 서비스이용 과정에서 이용자에 관한 정보를 자동화된 방법으로 생성하여
      이를 저장(수집)하거나, 이용자 기기의 고유한 정보를 원래의 값을 확인하지 못
      하도록 안전하게 변환하여 수집합니다. 서비스 이용 과정에서 위치정보가
      수집될 수 있으며, BEEZ에서 제공하는 위치기반 서비스에 대해서는'BEEZ
      위치정보 이용약관'에서 자세하게 규정하고 있습니다. 이와 같이 수집된 정보는
      개인정보와의 연계 여부 등에 따라 개인정보에 해당할 수 있고, 개인정보에
      해당하지 않을 수도 있습니다.
    </p>
    <p>
      2. 수집한 개인정보의 이용 BEEZ 및 BEEZ 관련 제반 서비스(모바일 웹/앱
      포함)의 회원관리, 서비스 개발・제공 및 향상, 안전한 인터넷 이용환경 구축
      등 아래의 목적으로만 개인정보를 이용합니다.
    </p>
    <p>
      - 회원 가입 의사의 확인, 연령 확인 및 법정대리인 동의 진행, 이용자 및
      법정대리인의 본인 확인, 이용자 식별, 회원탈퇴 의사의 확인 등 회원관리를
      위하여 개인정보를 이용합니다.
    </p>
    <p>
      - 콘텐츠 등 기존 서비스 제공(광고 포함)에 더하여, 인구통계학적 분석,
      서비스 방문 및 이용기록의 분석, 개인정보 및 관심에 기반한 이용자간 관계의
      형성, 지인 및 관심사 등에 기반한 맞춤형 서비스 제공 등 신규 서비스 요소의
      발굴 및 기존 서비스 개선 등을 위하여 개인정보를 이용합니다.
    </p>
    <p>
      - 법령 및 BEEZ 이용약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용
      행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위에 대한 방지 및
      제재, 계정도용 및 부정거래 방지, 약관 개정 등의 고지사항 전달, 분쟁조정을
      위한 기록 보존, 민원처리 등 이용자 보호 및 서비스 운영을 위하여 개인정보를
      이용합니다.
    </p>
    <p>
      - 유료 서비스 제공에 따르는 본인인증, 구매 및 요금 결제를 위하여
      개인정보를 이용합니다. - 이벤트 정보 및 참여기회 제공, 광고성 정보 제공 등
      마케팅 및 프로모션 목적으로 개인정보를 이용합니다.
    </p>
    <p>
      - 서비스 이용기록과 접속 빈도 분석, 서비스 이용에 대한 통계, 서비스 분석
      및 통계에 따른 맞춤 서비스 제공 및 광고 게재 등에 개인정보를 이용합니다.
    </p>
    <p>
      - 보안, 프라이버시, 안전 측면에서 이용자가 안심하고 이용할 수 있는 서비스
      이용환경 구축을 위해 개인정보를 이용합니다.
    </p>
    <p>
      개인정보 수집 및 이용 동의를 거부할 권리 이용자는 개인정보의 수집 및 이용
      동의를 거부할 권리가 있습니다. 회원가입 시 수집하는 최소한의 개인정보, 즉,
      필수 항목에 대한 수집 및 이용 동의를 거부하실 경우, 회원가입이 어려울 수
      있습니다.
    </p>
    <b-button class="modal_checkbox_back" @click="$bvModal.hide('modal2')"
      >확 인</b-button
    >
  </b-modal>
</template>
<script>
export default {};
</script>
<style>
/* -------------------------------모달창 css------------------------------------- */
#modal1,
#modal2 {
  font-family: "KoPubWorldDotumLight";
}

.modal_checkbox_back {
  padding: 1% 45%;
  display: block;
  background-color: rgb(180, 183, 199);
  border-color: rgb(180, 183, 199);
  color: #fff;
  margin-top: 40px;
}
.modal-header {
  margin: 3%;
  text-align: center;
}
.modal-body {
  font-size: 12px;
}
</style>
